0/k
FoamFile { version 2.0; format ascii; class volScalarField; object k; }
dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0.01; // Low initial turbulence
boundaryField
{
    inlet   { type fixedValue; value $internalField; }
    outlet  { type zeroGradient; }
    walls   { type slip; }
    talon   { type kLowReWallFunction; value $internalField; }
}
