0/nut
FoamFile { version 2.0; format ascii; class volScalarField; object nut; }
dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0;
boundaryField
{
    inlet   { type calculated; value $internalField; }
    outlet  { type calculated; value $internalField; }
    walls   { type slip; }
    talon   { type nutkWallFunction; value $internalField; }
}
