0/omega
FoamFile { version 2.0; format ascii; class volScalarField; object omega; }
dimensions      [0 0 -1 0 0 0 0];
internalField   uniform 10;
boundaryField
{
    inlet   { type fixedValue; value $internalField; }
    outlet  { type zeroGradient; }
    walls   { type slip; }
    talon   { type omegaWallFunction; value $internalField; }
}
