system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (-5 -4 -2) // 0: Bottom-back-left
    (10 -4 -2) // 1: Bottom-front-left
    (10  4 -2) // 2: Bottom-front-right
    (-5  4 -2) // 3: Bottom-back-right
    (-5 -4  2) // 4: Top-back-left
    (10 -4  2) // 5: Top-front-left
    (10  4  2) // 6: Top-front-right
    (-5  4  2) // 7: Top-back-right
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (60 40 20) simpleGrading (1 1 1)
);

edges ();

boundary
(
    inlet
    {
        type patch;
        faces ((0 4 7 3));
    }
    outlet
    {
        type patch;
        faces ((1 2 6 5));
    }
    walls
    {
        type wall;
        faces
        (
            (0 1 5 4) // ground
            (3 7 6 2) // ceiling
            (4 5 6 7) // side left
            (0 3 2 1) // side right
        );
    }
);
